/*--------------------------------------------------------------------------------------------------------------------------------------------------------------
Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
----------------------------------------------------------------------------------------------------------------------------------------------------------------
30.04.2025	konstantin@5277.ru		Начало
--------------------------------------------------------------------------------------------------------------------------------------------------------------*/
package ru.vm5277.j8b.compiler.tokens;

import ru.vm5277.j8b.compiler.enums.TokenType;

public class TLabel extends Token {
	public TLabel(String keyword, int pos, int line, int column) {
		type = TokenType.LABEL;
		
		endPos = pos+1;
		this.line = line;
		this.column++;
		
		value = keyword;
	}
}
