/*--------------------------------------------------------------------------------------------------------------------------------------------------------------
Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
----------------------------------------------------------------------------------------------------------------------------------------------------------------
22.04.2025	konstantin@5277.ru		Начало
--------------------------------------------------------------------------------------------------------------------------------------------------------------*/
package ru.vm5277.avr_asm;

public enum TokenType {
	// Ключевые слова, keywords(разбитые по категориям)
	LITERAL,	//Булевые заняения и null
	COMMAND,	//Команды
	DIRECTIVE,	//Директива ассемблера
	MNEMONIC,	//Мнемоника ассемблера
	
	ID,
	INDEX_REG,
	LABEL,
	NUMBER,
	OPERATOR,
	DELIMITER,
	STRING,
	CHAR,
	MACRO_PARAM,
	EOF,
	NEWLINE
}
