;-----------------------------------------------------------------------------------------------------------------------
;Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
;-----------------------------------------------------------------------------------------------------------------------
;02.06.2025	konstantin@5277.ru		Взят из проекта core5277
;-----------------------------------------------------------------------------------------------------------------------
;--------------------------------------------------------
WAIT_MS:
;--------------------------------------------------------
;Ждем истечения времени с момента прошлого сна или
;с момента вызова C5_TIMER_MARK
;IN ACCUM_H,ACCUM_L - время в 0.001s
;--------------------------------------------------------
	PUSH ACCUM_H
	PUSH ACCUM_L
	PUSH_T16

	LDS TEMP_H,UPTIME+0x05
_WAIT_MS__LOOP:
	LDS TEMP_L,UPTIME+0x05
	CP TEMP_H,TEMP_L
	BREQ _WAIT_MS__LOOP
	LDS TEMP_L,UPTIME+0x05
	SUB ACCUM_L,TEMP_L
	SBC ACCUM_H,C0x00
	BRCC _WAIT_MS__LOOP

	POP_T16
	POP ACCUM_L
	POP ACCUM_H
	RET
