/*--------------------------------------------------------------------------------------------------------------------------------------------------------------
Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
----------------------------------------------------------------------------------------------------------------------------------------------------------------
24.04.2025	konstantin@5277.ru		Начало
--------------------------------------------------------------------------------------------------------------------------------------------------------------*/
package ru.vm5277.j8b.compiler;

public class SemanticError extends RuntimeException {
    private	final	SourceBuffer sb;

    public SemanticError(String message, SourceBuffer sb) {
        super("[Semantic Error] " + message + " at " + sb.toString());
        
		this.sb = sb.clone();
    }
}