;-----------------------------------------------------------------------------------------------------------------------
;Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
;-----------------------------------------------------------------------------------------------------------------------
;02.06.2025	konstantin@5277.ru		Взят из проекта core5277
;-----------------------------------------------------------------------------------------------------------------------
.IFNDEF RAM_FILL_NR

;-----------------------------------------------------------
RAM_FILL_NR:
;-----------------------------------------------------------
;Заполнение блока памяти значением							;NR-NO_RESTORE - не восстанавливает IN регистры.
;IN: X-адрес, ACCUM_L-значение, Y-длина
;-----------------------------------------------------------
_RAM_FILL_NR__LOOP:
	ST X+,ACCUM_L
	SBIW YL,0x01
	BRNE _RAM_FILL_NR__LOOP
	RET
.ENDIF
