;-----------------------------------------------------------------------------------------------------------------------
;Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
;-----------------------------------------------------------------------------------------------------------------------
;02.06.2025	konstantin@5277.ru		Взят из проекта core5277
;-----------------------------------------------------------------------------------------------------------------------
.include "./core/wait_ms.inc"
.IFNDEF WAIT_S
;--------------------------------------------------------
WAIT_S:
;--------------------------------------------------------
;Ждем
;IN ACCUM_H, ACCUM_L - время в 1s
;--------------------------------------------------------
	PUSH ACCUM_H
	PUSH ACCUM_L
	PUSH_T16

	MOV TEMP_H,ACCUM_H
	MOV TEMP_L,ACCUM_L
	LDI ACCUM_H,high(1000);
	LDI ACCUM_L,low(1000);

_WAIT_S__LOOP:
	SUBI TEMP_L,0x01
	SBCI TEMP_H,0x00
	BRCS _WAIT_S__END
	MCALL WAIT_MS
	RJMP _WAIT_S__LOOP

_WAIT_S__END:
	POP_T16
	POP ACCUM_L
	POP ACCUM_H
	RET
.ENDIF
