;-----------------------------------------------------------------------------------------------------------------------
;Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
;-----------------------------------------------------------------------------------------------------------------------
;17.06.2025	konstantin@5277.ru		Взят из проекта core5277
;-----------------------------------------------------------------------------------------------------------------------
.IFNDEF PORT_INVERT
.include "io/_port_offset.inc"
.include "io/reg_bit_inv.inc"
;--------------------------------------------------------
PORT_INVERT:
;--------------------------------------------------------
;Инвертирование состояния порта
;IN: ACCUM_L адрес регистра PORTx
;OUT: flag C-состояние бита(true = HI)
;--------------------------------------------------------;
	CPI ACCUM_L,0xff
	BRNE PC+0x02
	RET

	PUSH_Z
	PUSH ACCUM_L

	MCALL _PORT_OFFSET
	MCALL REG_BIT_INV

	POP ACCUM_L
	POP_Z
	RET
.ENDIF
