;-----------------------------------------------------------------------------------------------------------------------
;Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
;-----------------------------------------------------------------------------------------------------------------------
;30.05.2025	konstantin@5277.ru		Взят из проекта core5277
;-----------------------------------------------------------------------------------------------------------------------
.include "io/_port_offset.asm"
.include "io/reg_bit_hi.asm"
.IFNDEF PORT_MODE_OUT
;--------------------------------------------------------
PORT_MODE_OUT:
;--------------------------------------------------------
;Устанвливаем порт на выход
;IN: ACCUM_L-порт
;--------------------------------------------------------
	CPI ACCUM_L,0xff
	BRNE PC+0x02
	RET

	PUSH_Z
	PUSH ACCUM_L

	MCALL _PORT_OFFSET
	ADIW ZL,0x01
	MCALL REG_BIT_HI

	POP ACCUM_L
	POP_Z
	RET
.ENDIF
