;-----------------------------------------------------------------------------------------------------------------------
;Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
;-----------------------------------------------------------------------------------------------------------------------
;02.06.2025	konstantin@5277.ru		Взят из проекта core5277
;-----------------------------------------------------------------------------------------------------------------------
.include	"./conv/_bit_to_mask_table.asm"

;-----------------------------------------------------------
_PORT_OFFSET:
;-----------------------------------------------------------
;Возвращаем смещение на первый адрес регистров порта
;IN: ACCUM_L-сдвоенный порт и пин (PA0, PC7 и т.п.)
;OUT: Z-адрес регистра PINx, ACCUM_L-пин в виде числа
;-----------------------------------------------------------
	PUSH TEMP
	MOV TEMP,ACCUM_L
	ANDI ACCUM_L,0x0f

	LDI_Z _BIT_TO_MASK_TABLE*2
	ADD ZL,ACCUM_L
	ADC ZH,C0x00
	LPM ACCUM_L,Z

	SWAP TEMP
	ANDI TEMP,0x0f

	LDI_Z PORTS_TABLE*2
	ADD ZL,TEMP
	ADC ZH,C0x00
	LPM ZL,Z
	LDI ZH,0x00
	POP TEMP
	RET
