;-----------------------------------------------------------------------------------------------------------------------
;Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
;-----------------------------------------------------------------------------------------------------------------------
;17.06.2025	konstantin@5277.ru		Взят из проекта core5277
;-----------------------------------------------------------------------------------------------------------------------
.IFNDEF OS_OUT_INIT
;-----------------------------------------------------------
OS_OUT_INIT:
;-----------------------------------------------------------
;Инициализация порта логирования
;-----------------------------------------------------------
	PUSH_Z
	PUSH TEMP_L

	LDI_Z PORTS_TABLE*2+(STDOUT_PORT>>4)					;PINx
	LPM ZL,Z
	ADIW ZL,0x02											;PORTx
	CLR ZH
	LD TEMP_L,Z
	ORI TEMP_L,EXP2(STDOUT_PORT & 0x0f)
	ST Z,TEMP_L

	LDI_Z PORTS_TABLE*2+(STDOUT_PORT>>4)					;PINx
	LPM ZL,Z
	ADIW ZL,0x01											;DDRx
	CLR ZH
	LD TEMP_L,Z
	ORI TEMP_L,EXP2(STDOUT_PORT & 0x0f)
	ST Z,TEMP_L

	POP TEMP_L
	POP_Z
	RET
.ENDIF

