;-----------------------------------------------------------------------------------------------------------------------
;Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
;-----------------------------------------------------------------------------------------------------------------------
;17.06.2025	konstantin@5277.ru		Взят из проекта core5277
;-----------------------------------------------------------------------------------------------------------------------
.IFNDEF OS_OUT_CSTR
.include "stdout/out_char.asm"
;--------------------------------------------------------
OS_OUT_CSTR:
;--------------------------------------------------------
;Логирование строки, конец определяется по 0x00
;IN: Z-адрес FLASH на строку
;--------------------------------------------------------
	PUSH TEMP_L
	PUSH_Z

_OS_OUT_CSTR__LOOP:
	;Считываем байт
	LPM TEMP_L,Z+
	CPI TEMP_L,0x00
	BREQ _OS_OUT_CSTR__END
	MCALL OS_OUT_CHAR
	RJMP _OS_OUT_CSTR__LOOP

_OS_OUT_CSTR__END:
	POP_Z
	POP TEMP
	RET
.ENDIF
