/*--------------------------------------------------------------------------------------------------------------------------------------------------------------
Файл распространяется под лицензией GPL-3.0-or-later, https://www.gnu.org/licenses/gpl-3.0.txt
----------------------------------------------------------------------------------------------------------------------------------------------------------------
22.04.2025	konstantin@5277.ru		Начало
--------------------------------------------------------------------------------------------------------------------------------------------------------------*/
package ru.vm5277.j8b.compiler.tokens.enums;

public enum TokenType {
	// Ключевые слова, keywords(разбитые по категориям)
	LITERAL,	//Булевые заняения и null
	TYPE,		//Типы данных
	COMMAND,	//Команды
	MODIFIER,	//Модификаторы
	OOP,		//Ключевые слова ООП
	KEYWORD,	//Остальные ключевые слова
	
	ID,
	NUMBER,
	OPERATOR,
	DELIMITER,
	STRING,
	CHAR,
	EOF,
	NEWLINE
}
